# Pandas

In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   --- ------------------------------------ 1.0/11.5 MB 5.6 MB/s eta 0:00:02
   -------- ------------------------------- 2.4/11.5 MB 5.8 MB/s eta 0:00:02
   ------------ --------------------------- 3.7/11.5 MB 6.1 MB/s eta 0:00:02
   ----------------- ---------------------- 5.0/11.5 MB 5.9 MB/s eta 0:00:02
   -------------------- ------------------- 5.8/11.5 MB 5.3 MB/s eta 0:00:02
   ------------------------- -------------- 7.3/11.5 MB 5.6 MB/s eta 0:00:01
   ------------------------------ --------- 8.7/11.5 MB 5.9 MB/s eta 0:00:01
   ------------------------------------ --- 10.5/11.5 MB 6.0 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 5.9 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
import numpy as np

In [3]:
print(pd.__version__)
print(np.__version__)

2.2.3
2.2.4

In [4]:
l1 =[1,2,3,4,5,6,7]

In [5]:
series1 = pd.Series(l1)
print(series1)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [6]:
type(series1)

pandas.core.series.Series

 ser2 = pd.Series(data-to-be-added-in-series, index =['a','b'....]
We can give index, dtype='f8']

to access element of series is similar to that of array/list

In [7]:
print(series1[0])
print(series1[4])

1
5

In [8]:
pds = pd.Series(l1,index=['a','b','c','d','e','f','g'], dtype ='f8',name ='PandaSeries')

In [9]:
pds

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
g    7.0
Name: PandaSeries, dtype: float64

In [10]:
marks ={
    'Phy':[89,99,92,78,69],
    'Chem': [85, 95, 90, 82, 75],
    'Maths': [91, 88, 85, 80, 77],
    'SST': [91, 88, 85, 80, 77],
    'English': [89,99,92, 80, 77]
}

In [11]:
marks

{'Phy': [89, 99, 92, 78, 69],
 'Chem': [85, 95, 90, 82, 75],
 'Maths': [91, 88, 85, 80, 77],
 'SST': [91, 88, 85, 80, 77],
 'English': [89, 99, 92, 80, 77]}

In [12]:
type(marks)

dict

In [13]:
pd1 = pd.DataFrame(marks,index = ['A','B','C','D','F'])
print(pd1)

   Phy  Chem  Maths  SST  English
A   89    85     91   91       89
B   99    95     88   88       99
C   92    90     85   85       92
D   78    82     80   80       80
F   69    75     77   77       77

# Above we made disct then using that created dataFrame then eachh column is a numpy series

In [14]:
pd1.to_csv("Marks.csv")

In [15]:
print(pd1)

   Phy  Chem  Maths  SST  English
A   89    85     91   91       89
B   99    95     88   88       99
C   92    90     85   85       92
D   78    82     80   80       80
F   69    75     77   77       77

In [16]:
reading = pd.read_csv("./Marks.csv", index_col='Unnamed: 0')
print(reading)

   Phy  Chem  Maths  SST  English
A   89    85     91   91       89
B   99    95     88   88       99
C   92    90     85   85       92
D   78    82     80   80       80
F   69    75     77   77       77

In [17]:
pd1.tail(2)

   Phy  Chem  Maths  SST  English
D   78    82     80   80       80
F   69    75     77   77       77

In [18]:
pd1.head(2)

   Phy  Chem  Maths  SST  English
A   89    85     91   91       89
B   99    95     88   88       99

In [19]:
pd1= pd1.drop(columns=['Maths'])

In [20]:
pd1

   Phy  Chem  SST  English
A   89    85   91       89
B   99    95   88       99
C   92    90   85       92
D   78    82   80       80
F   69    75   77       77

above can be achieved using inplace to drop the column from original dataFrame rather than generating new dataFrame

In [21]:
pd1.drop(columns =['Phy'], inplace =True)

In [22]:
pd1

   Chem  SST  English
A    85   91       89
B    95   88       99
C    90   85       92
D    82   80       80
F    75   77       77

In [23]:
pd1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to F
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Chem     5 non-null      int64
 1   SST      5 non-null      int64
 2   English  5 non-null      int64
dtypes: int64(3)
memory usage: 160.0+ bytes

In [24]:
pd1.describe()

            Chem        SST    English
count   5.000000   5.000000   5.000000
mean   85.400000  84.200000  87.400000
std     7.635444   5.718391   8.961027
min    75.000000  77.000000  77.000000
25%    82.000000  80.000000  80.000000
50%    85.000000  85.000000  89.000000
75%    90.000000  88.000000  92.000000
max    95.000000  91.000000  99.000000

In [25]:
pd1['Chem'] # To access a particular column to see multiple cloumns we need to do pd1[['phy','chem'....so on]]

A    85
B    95
C    90
D    82
F    75
Name: Chem, dtype: int64

In [26]:
pd1.loc['A'] # using row

Chem       85
SST        91
English    89
Name: A, dtype: int64

In [27]:

pd1[['Chem','English']]

   Chem  English
A    85       89
B    95       99
C    90       92
D    82       80
F    75       77

In [28]:
pd1

   Chem  SST  English
A    85   91       89
B    95   88       99
C    90   85       92
D    82   80       80
F    75   77       77

In [29]:
print(pd1.iloc[[2,1]]) # 2 and 1 st row 
print(pd1.iloc[1,2]) #2nd row 1 col 
# print(pd1.iloc[2,3])
pd1
print(pd1.iloc[2:5,0:2]) # 1st row and 2nd columns
# print(pd1.iloc[2:5,0:2]) # 2st row and 2nd columns

   Chem  SST  English
C    90   85       92
B    95   88       99
99
   Chem  SST
C    90   85
D    82   80
F    75   77

In [30]:
pd1[pd1>90]

   Chem   SST  English
A   NaN  91.0      NaN
B  95.0   NaN     99.0
C   NaN   NaN     92.0
D   NaN   NaN      NaN
F   NaN   NaN      NaN

Weather Ques- Day at which temp in mumbai is greater than 80

In [32]:
# DataC = pd.read_csv("weather_data_cities.csv")
# # print(DataC)
# # DataFrame[condition]['column_name']  Concept
# mumbaiData = DataC.iloc[4:8]
# mumbaiData[mumbaiData["temperature"]>=90]['day']

In [41]:
er =np.array([1,2,2,3,4,5,5,6,6,7,7,5,3,2,2])
print(np.unique(er,return_counts=True))

(array([1, 2, 3, 4, 5, 6, 7]), array([1, 4, 2, 1, 3, 2, 2]))

.sort_values() can be done using row and column

.get_dummies() done for one Hot Encoding

In [42]:
pdc = pd.Series(['A','B','A','B','A','B','B',])
pdc

0    A
1    B
2    A
3    B
4    A
5    B
6    B
dtype: object

In [43]:
# pdc = pd.get_dummies()

In [50]:
 DataC = pd.read_csv("weather_data_cities.csv")
print(DataC)

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [54]:
# gdf = DataC.groupby(by='city')
# for city in gdf:
#     print(city)
# .pivot()

In [55]:
DataC.pivot(columns ='city', index ='day')

         temperature                windspeed                 event           \
city          mumbai new york paris    mumbai new york paris mumbai new york
day
1/1/2017          90       32    45         5        6    20  Sunny     Rain
1/2/2017          85       36    50        12        7    13    Fog    Sunny
1/3/2017          87       28    54        15       12     8    Fog     Snow
1/4/2017          92       33    42         5        7    10   Rain    Sunny


city       paris
day
1/1/2017   Sunny
1/2/2017  Cloudy
1/3/2017  Cloudy
1/4/2017  Cloudy

In [69]:
d1 = {
    'A':[11,22,33,44],
    'B':[5,6,7,8]
}
d2 = {
    'A':[11,22,33,44],
    'c':[5,6,7,8]
}

In [70]:
df1 = pd.DataFrame(d1)
df2= pd.DataFrame(d2)

In [71]:
df1

    A  B
0  11  5
1  22  6
2  33  7
3  44  8

In [75]:
df3 = pd.concat([df1,df2], ignore_index = True,join='inner')
df3

    A
0  11
1  22
2  33
3  44
4  11
5  22
6  33
7  44

In [76]:
mdf3 = pd.merge(df1,df2,how = 'outer')
# inner outer right left
mdf3

    A  B  c
0  11  5  5
1  22  6  6
2  33  7  7
3  44  8  8

In [78]:
# mean na filna merge concat

In [79]:
# Interpolate

In [80]:
# in Data we fill na values by mean or interpolate which is upar niche ki value in terms of value which is NaN

In [81]:
# limit  or limit direction in interpolate